In [2]:
import pandas as pd

schooling_data = pd.read_csv("IDH/expected-years-of-schooling.csv")
schooling_data.head()

        Entity Code  Year  Expected Years of Schooling (years)
0  Afghanistan  AFG  1990                                  2.6
1  Afghanistan  AFG  1991                                  2.9
2  Afghanistan  AFG  1992                                  3.2
3  Afghanistan  AFG  1993                                  3.6
4  Afghanistan  AFG  1994                                  3.9

In [3]:
schooling_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5142 entries, 0 to 5141
Data columns (total 4 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   Entity                               5142 non-null   object
 1   Code                                 5124 non-null   object
 2   Year                                 5142 non-null   int64
 3   Expected Years of Schooling (years)  5142 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 160.8+ KB

In [4]:
from statistics_calc import descriptors

# Generate descriptors
desc = descriptors(schooling_data)

# Export the DataFrame to a CSV file
desc.to_csv("descriptors/schooling.csv", decimal=",")

desc

                 Year  Expected Years of Schooling (years)
count     5142.000000                          5142.000000
mean      2003.810968                            11.748269
std          8.037650                             3.346839
min       1990.000000                             2.100000
25%       1997.000000                             9.800000
50%       2004.000000                            12.100000
75%       2011.000000                            13.975000
max       2017.000000                            23.300000
skewness    -0.049536                            -0.356944
kurtosis    -1.185758                             0.064490
IQR         14.000000                             4.175000

In [5]:
from statistics_calc import qualitative_stats

# Columnas cualitativas de interés
cols_cualitativas = ["Entity", "Code"]

# Generate statistics
estadisticas = qualitative_stats(schooling_data, cols_cualitativas)

# Guardar datos en un archivo CSV
estadisticas.to_csv("descriptors/schooling_quality.csv", index=False, decimal=",")

# Mostrar el DataFrame de estadísticas
estadisticas

c:\Users\alvar\VSCode Projects\IN\statistics_calc.py:50: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  estadisticas = pd.concat([estadisticas, nueva_fila], ignore_index=True)

,Columna,Moda,Moda (#),Moda (%),Valores unicos (#),Valores unicos (%),Valores nulos (%)
0,Entity,Afghanistan,28,0.544535,193,3.753403,0.000000
1,Code,AFG,28,0.544535,192,3.733956,0.350058

In [8]:
# count the number of missing values in each column
missing = schooling_data.isnull().sum()
missing = missing[missing > 0]
missing.sort_values(inplace=True)
missing

Code    18
dtype: int64